---
title: FaceSplitterFailures
classe: Autodesk.Revit.DB.BuiltInFailures+FaceSplitterFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FaceSplitterFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotUseCurvesForFaceSplit { get; }` | `FaceSplitterFailures.CannotUseCurvesForFaceSplit` | FailureDefinitionId |
| `FailureDefinitionId EndsNotOnEdgeError { get; }` | `FaceSplitterFailures.EndsNotOnEdgeError` | FailureDefinitionId |
| `FailureDefinitionId InvalidClosedLoopsForFaceSplit { get; }` | `FaceSplitterFailures.InvalidClosedLoopsForFaceSplit` | FailureDefinitionId |
| `FailureDefinitionId InvalidOpenLoopsForFaceSplit { get; }` | `FaceSplitterFailures.InvalidOpenLoopsForFaceSplit` | FailureDefinitionId |
| `FailureDefinitionId LoopsDoNotSubdivideFace { get; }` | `FaceSplitterFailures.LoopsDoNotSubdivideFace` | FailureDefinitionId |
| `FailureDefinitionId LoopsOutsideFaceSplitError { get; }` | `FaceSplitterFailures.LoopsOutsideFaceSplitError` | FailureDefinitionId |
| `FailureDefinitionId NoFaceForSplit { get; }` | `FaceSplitterFailures.NoFaceForSplit` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```